Revit 2027 API
RebarContainerItem.IsRebarInSection Method
 Identifies if this rebar set is shown as a cross-section in the given view.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsRebarInSection(
	View dBView
)
Public Function IsRebarInSection (
	dBView As View
) As Boolean
public:
bool IsRebarInSection(
	View^ dBView
)
member IsRebarInSection :
        dBView : View -> bool
Parameters
dBView View
 The view.
Return Value
Boolean
 True if this rebar set is shown as a cross-section, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace